Revit 2027 API
ExportLayerInfo.LayerName Property
 The layer name stored in value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LayerName { get; set; }
Public Property LayerName As String
	Get
	Set
public:
property String^ LayerName {
	String^ get ();
	void set (String^ value);
}
member LayerName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace